{
  "title": "Librarian of Congress firing is latest move in upheaval of U.S. cultural institutions",
  "url": "https://www.npr.org/2025/05/09/nx-s1-5393737/carla-hayden-fired-library-of-congress-trump",
  "source": "NPR Topics: News",
  "bias_label": "center-left",
  "published": "2025-05-09T20:36:41",
  "content": "Librarian of Congress firing is latest move in upheaval of U.S. cultural institutions\n\ntoggle caption Al Drago/Getty Images\n\nBy firing the Librarian of Congress Carla Hayden on Thursday night, President Trump continued his remaking of American cultural institutions.\n\nHayden was the first woman and the first African American to hold the post. She was also the first person in the job to be term-limited. Her time was set to expire next year.\n\n\"There were quite concerning things that she had done at the Library of Congress in the pursuit of DEI and putting inappropriate books in the library for children,\" said White House press secretary Karoline Leavitt on Friday.\n\nNPR has reached out to Hayden for comment.\n\nSponsor Message\n\nThe Library of Congress does a lot of things. It's the main research arm of the U.S. Congress. It houses the U.S. Copyright Office. It organizes the National Book Festival every year (which, full disclosure, has hosted NPR journalists). But it also houses a giant trove of books, films, recordings, manuscripts, newspapers, and more, making it one of the largest libraries in the world.\n\nWhen Hayden first got the job in 2016, her main task was bringing the Library of Congress into the 21st century and digitizing the collection. It was a pretty big job, considering the Government Accountability Office had just published a report in 2015 with the headline: \"Strong Leadership Needed to Address Serious Information Technology Management Weaknesses.\"\n\nBy most accounts, Hayden's work in strengthening the Library's digital infrastructure has been a success. At a hearing of the House Administration committee Tuesday, Republican Congressman Bryan Steil praised Hayden and her staff, saying they \"dedicate a lot of time and service to the country and the Library of Congress, and their work should be commended.\"\n\nWhile libraries in general have become fought-over turf in the broader culture wars, the Library of Congress has mostly stayed out of those controversies. Beside checking in on the process of digitization, the other topic of discussion in this week's hearing was the remodeling its of the Library's main reading room.\n\nSponsor Message\n\nDemocratic lawmakers, including Sen. Chuck Schumer and Rep. Hakeem Jeffries, have criticized the firing.\n\nAlso this week, a number of senior staff at the National Endowment for the Arts left their posts. In a letter published by the literary magazine N+1, four members of the NEA's literary arts staff announced their departures. \"While we don't know specifically how the work of the agency will change, we know the remaining staff will do their best to support you,\" the letter read.\n\nPresident Trump had previously proposed eliminating the NEA. Over the weekend, arts groups across the country got an email saying their grants from the National Endowment for the Arts had been canceled. It read, \"The NEA is updating its grantmaking policy priorities to focus funding on projects that reflect the nation's rich artistic heritage and creativity as prioritized by the President.\"\n\nThis has since left arts groups – across the country scrambling for funding.\n\nAnd on Wednesday, CNN reported that a number of performers in the upcoming production of Les Misérables at the Kennedy Center are planning on boycotting when President Trump sees the show on June 11.\n\nTrump's takeover of the Kennedy Center was an early show of force. He fired Deborah Rutter, who served as president of the performing arts center for a decade, and installed Richard Grenell as its interim president. Trump also placed himself as chair of the board. A number of artists who were slated to perform cancelled their appearances in response.\n\nThis is just a portion of Trump's changes to arts institutions since he took office in January. He's also attempted to cut staff at the National Endowment for the Humanities, and the Institute of Museum and Library Services.\n\nMeghan Sullivan edited this story.",
  "tags": [],
  "collected_at": "2025-05-09T23:50:43.375350",
  "id": "46b7ded2793e0b61_1746834646",
  "document_id": "46b7ded2793e0b61_1746834646"
}