{
  "title": "New Jersey mayor arrested for protesting at migrant centre",
  "url": "https://www.bbc.com/news/articles/cy904elvxj3o",
  "source": "BBC News",
  "bias_label": "center",
  "published": "2025-05-09T21:57:19",
  "content": "New Jersey mayor arrested for protesting at migrant centre\n\nMayor Baraka, seen visiting the same facility on Wednesday\n\nBaraka was accompanied by three Democratic members of Congress, who were not arrested. They say they were there to conduct \"oversight\" to ensure that the facility is not violating any building safety ordinances.\n\nNewark Mayor Ras Baraka, who is running for New Jersey governor, \"committed trespass and ignored multiple warnings\", to leave Delaney Hall, a detention facility being run by Immigration and Customs Enforcement (ICE), according to acting US attorney for New Jersey Alina Habba.\n\nThe mayor of New Jersey's largest city has been arrested after allegedly trying to force his way into a migrant detention facility.\n\n\"The Mayor of Newark, Ras Baraka, committed trespass and ignored multiple warnings from Homeland Security Investigations to remove himself from the ICE detention center,\" Ms Habba, who previously worked as a personal lawyer to Donald Trump, wrote on X.\n\n\"He has willingly chosen to disregard the law. That will not stand in this state. He has been taken into custody. NO ONE IS ABOVE THE LAW.\"\n\nA statement from the Department of Homeland Security said that a group of protesters, which included the Democrats, \"stormed the gate and broke into the detention facility\" as a bus with illegal migrants was being brought inside the fenced perimeter.\n\n\"These members of Congress storming into a detention facility goes beyond bizarre political stunt and puts the safety of our law enforcement agents and the detainees at risk,\" the statement adds.\n\nThe department said it would have granted the members a tour of the 1,000-bed facility had they requested one.\n\nNew Jersey's Democratic Governor Phil Murphy said he was \"outraged\" by Baraka's arrest and called for him to be immediately released.\n\nNew Jersey Democratic lawmakers Rob Menendez Jr, Bonnie Watson Coleman and LaMonica McIver were also present during the protest.\n\nCity officials allege the private firm that signed a contract with ICE did not obtain proper permits and blocked necessary inspections. The firm has told media they haver the proper permits.\n\nEarlier on Friday, Congresswoman Watson Coleman posted on social media: \"We're at Delaney Hall, an ICE prison in Newark that opened without permission from the city & in violation of local ordinances.\n\n\"We've heard stories of what it's like in other ICE prisons. We're exercising our oversight authority to see for ourselves.\"\n\nIn another post, Congresswoman McIver said that Baraka \"did nothing wrong\" and had already left the facility when he was arrested.\n\nThe move comes as federal agencies continue their crackdown on illegal immigration, following up on a key campaign promise made by President Trump.",
  "tags": [],
  "collected_at": "2025-05-09T23:50:59.789316",
  "id": "b7f85c29693ce5f6_1746834661",
  "document_id": "b7f85c29693ce5f6_1746834661"
}