{
  "title": "Sean Combs trial: Cassie concludes four days of testimony",
  "url": "https://www.npr.org/2025/05/16/nx-s1-5401461/sean-combs-trial-cassie-concludes-testimony",
  "source": "NPR Topics: News",
  "bias_label": "center-left",
  "published": "2025-05-17T02:11:07",
  "content": "Sean Combs trial: Cassie concludes four days of testimony\n\ntoggle caption Neilson Barnard/Getty Images\n\nAfter spending most of four days on the witness stand, Cassie Ventura concluded her testimony in the criminal trial of Sean Combs on Friday afternoon. Ventura, who dated Combs on and off for over a decade, was one of several witnesses to take the stand during the trial's first week . But the extent and detail of her testimony showed how central she is to the government's case against Combs.\n\nVentura filed the first prominent civil lawsuit against Combs in 2023, alleging that the rapper and record executive had physically assaulted, trafficked and raped her. That suit was settled quickly, but Combs was indicted in September 2024 on charges of sex trafficking, transporting to engage in prostitution and racketeering conspiracy. He pleaded not guilty to all charges.\n\nSponsor Message\n\nStarting on Tuesday afternoon, a visibly pregnant Ventura testified that her relationship with Combs was marked with violence, drug use and power imbalances. The singer was 19 years old when she signed a 10-album deal with Combs' label, Bad Boy Records, in 2006. Combs, who is 17 years older than Ventura, pursued her romantically not long after they began working together. Ventura told prosecutors that within the first year of their relationship, Combs began physically abusing her. She testified that he coerced her into drug-fueled, highly-orchestrated sexual performances with male escorts that became \"like a job\" and put her career on the backburner (Ventura only ever released one of the 10 albums from her deal with his label). Ventura said she loved Combs, but he was often \"scary\" — and she did not always feel like she could safely leave the relationship.\n\nOne of Combs' defense attorneys, Anna Estevao, spent two days cross-examining Ventura. Again and again, she presented texts and emails exchanged between Combs and Ventura over that showed Ventura agreeing to sexual encounters with male sex workers and helping plan the logistics for these meetings. She also asked about Ventura's career and the opportunities she gained from being connected to Combs. When she asked if Ventura was easily able to leave her contract with Bad Boy upon breaking up with Combs in 2018, Ventura responded: \"I had to fight my way out.\"\n\nSponsor Message\n\nEstevao's cross-examination focused on painting Ventura and Combs as mutually invested in the relationship, and Ventura as a willing participant in unconventional sexual encounters. She asked Ventura to describe their use of drugs the way they would both grow jealous over alleged infidelities and the lengths they went to to keep the sexual performances with escorts a secret.\n\nDuring her direct questioning from prosecutors, Ventura testified that Combs filmed these encounters and blackmailed Ventura with them when she tried to move on from their relationship. She said that in 2014, someone she was working with at an event in Atlantic City hinted he had knowledge of a sexually explicit video of Ventura. She testified that she assumed it was a video of the \"freak-offs\" — a term she and Combs used to describe their encounters with escorts — and she anxiously texted Combs, who responded, \"This is crazy. Do not let him out of your sight.\" Ventura said she ended up taking Combs' security with her to \"intimidate\" the man.\n\nIn cross examination on Friday, Estevao referenced that testimony and played an audio recording of Ventura at that meeting, in which she can be heard repeatedly threatening to kill the man if he doesn't cooperate. \"I've never killed anybody in my life, but I'll kill you,\" she says in the recording. \"It's not going to be blood on my hands. Someone else is gonna do it.\"\n\nEstevao questioned Ventura on whether Combs also worried the videos would be leaked and whether they would hurt his reputation as well, not just hers. Ventura agreed.\n\nWhen the prosecution resumed questioning her, Ventura said she was acting under Combs' instructions at the time of that audio recording. She also testified that after they'd had an argument in Cannes and Ventura was trying to create distance between herself and Combs, he insisted on sitting next to her on the flight from France to New York. She said he spent the entirety of the trip showing Ventura explicit videos of her with an escort — and then pressured her to participate in a performance hours after landing.\n\nTowards the end of the defense's cross examination, Estevao asked Ventura about the settlement she received from her civil lawsuit against Combs. Ventura confirmed that the amount of the settlement was $20 million. When asked whether the settlement came at a time of financial hardship for her family, Ventura denied this was the case. Later, prosecutors also asked Ventura about the settlement. \"I'd give that money back if I never had to have freak-offs,\" Ventura said through tears. \"If I never had to have freak-offs, I would have agency and autonomy. I wouldn't have had to work so hard to gain it back.\"\n\nSponsor Message\n\nAfter Ventura's testimony concluded on Friday afternoon, two more witnesses were called to the stand. The first was special agent Yasin Binda with Homeland Security Investigations. Binda, who said she works with the human trafficking group at HSI, testified that she helped plan the logistics for Combs' arrest in September 2024 and carried out the search warrant on his room at the Park Hyatt Hotel in New York City. Binda testified that her role was to take photographs of the items found during the search. Those items included multiple bottles of baby oil and lubricant, illegal substances, a lighting device that could be used for \"mood lighting\" and $9,000 in cash — all items that matched Ventura's testimony of the supplies she and Combs used for \"freak-offs.\"\n\nAfter Binda finished testifying, the singer Dawn Richard took the stand. Richard was a member of the group Danity Kane, which Combs helped to put together in the mid-2000s as part of the reality TV competition Making The Band. Danity Kane was signed to Combs' Bad Boy Records for several years; Richard was also a member of the electrosoul trio Diddy Dirty Money alongside Combs and vocalist Kalenna Harper. Last year, Richard filed a civil lawsuit against Combs alleging a toxic and abusive working environment throughout her professional relationship with him — the lawsuit also stated that she witnessed Combs violently assaulting Ventura on more than one occasion.\n\nRichard testified briefly; she will remain on the stand next week. When she began her testimony on Friday, Richard described being present at an altercation in Combs' home in which he became \"belligerent\" as Ventura attempted to make him eggs; Richard testified that Combs grabbed the skillet Ventura was using and attempted to hit her over the head with it. She alleged Ventura dropped to the ground into fetal position while Combs punched and kicked her, eventually putting his arm around her neck and dragging her upstairs by her hair. \"I was scared for her,\" Richard told the court. \"I had never seen anything like that before.\"\n\n",
  "tags": [],
  "collected_at": "2025-05-17T03:53:08.563083",
  "id": "d3f8fcf8b173a8a6_1747453988",
  "document_id": "d3f8fcf8b173a8a6_1747453988"
}