{
  "title": "Cities aiming to thwart immigrant detention centers wield a secret weapon: local laws",
  "url": "https://www.npr.org/2025/05/09/nx-s1-5392341/cities-thwart-immigrant-detention-local-ordinances",
  "source": "NPR Topics: News",
  "bias_label": "center-left",
  "published": "2025-05-09T21:36:31",
  "content": "Cities aiming to thwart immigrant detention centers wield a secret weapon: local laws\n\ntoggle caption Zane Irwin/Kansas News Service\n\nFormer corrections officer William Rogers still remembers the exact spot in 2018 where an inmate slashed his head open with a metal lunch tray.\n\n\"When he hit me in the back of the head, I mean it hurt. But I didn't know it was split open, right? Because at that point you're just going to fight,\" he said.\n\nChronic understaffing and mismanagement at a now-closed private prison in Leavenworth, Kansas, made instances like this common, Rogers said. Memories of preventable overdoses, suicides, stabbings, medical neglect and overcrowded cells still haunt him.\n\nCoreCivic, the prison's owner and one of the country's largest private corrections companies, said in a statement that allegations of dangerous conditions in the past reflect isolated incidents during a limited timeframe.\n\nSponsor Message\n\nThe facility has sat vacant since 2021 , when then-President Joe Biden signed an executive order phasing out private prison contracts with the federal government.\n\nBut that could soon change. With a renewed federal push to expand immigration detention, CoreCivic plans to reopen the facility to hold up to 1,000 migrants.\n\ntoggle caption Zane Irwin/Kansas News Service\n\nPrivate prison companies are indispensable to federal immigration authorities, who aim to double detention capacity to 100,000 beds .\n\nTo that end, lawmakers in Congress are mulling a spending proposal that would provide $175 billion to the Department of Homeland Security over five years, a 65% percent increase in the agency's budget.\n\nNow Immigration and Customs Enforcement, or ICE, is sending out calls for new contracts with private corrections companies, in many cases to use dormant detention centers.\n\nBut many of these facilities had a history of serious issues. The Etowah County Detention Center in Alabama closed due to unsanitary conditions for inmates.\n\nICE is also eyeing FCI Dublin in the Bay Area, where reports of rampant sexual abuse gave the facility the grim moniker of \"the rape club.\"\n\nLocal lawsuits, national impact\n\nWhere proposals to reopen troubled prisons have surfaced, protests and legal challenges have followed. Local and state lawsuits are disrupting ICE's plan to reopen the Delaney Hall facility in New Jersey through a contract with another major private prison company, the GEO Group.\n\nSponsor Message\n\nOn Friday, federal officials arrested Newark Mayor Ras J. Baraka outside the ICE facility during a protest. U.S. Attorney for the District of New Jersey Alina Habba wrote on social media that Baraka \"committed trespass and ignored multiple warnings from Homeland Security Investigations to remove himself from the ICE detention center in Newark\" and that no one is above the law.\n\nThe city of Newark is suing GEO group over access and inspection rights. Baraka has held multiple protests outside the facility's gates, making no secret that his opposition goes beyond concerns about city regulations.\n\n\"Regardless of the process, an immigrant detention center is not welcomed here,\" he said in a February statement .\n\n\"ICE's stated intention to round up 'criminals' is a thin veil that does not conceal their scheme to violate people's rights, desecrate the Constitution, and disassemble our democracy,\" Baraka said.\n\nA similar standoff is unfolding in Kansas . The city of Leavenworth argues that CoreCivic needs to follow a two-month long formal process, with multiple opportunities for public input, before it can reopen the former prison.\n\nCoreCivic insists those rules don't apply because, even though the last inmates left the facility in 2021, it never closed.\n\ntoggle caption Zane Irwin/Kansas News Service\n\nWith a hearing scheduled in the coming weeks, It's unclear who will win in court. Nevertheless, the company is moving ahead with hiring and construction.\n\nLaws that target immigration detention specifically, like one in New Jersey, are difficult to make stick.\n\nBut Professor David S. Rubenstein at Washburn University in Topeka said smaller local governments have used their authority to mount serious challenges to ICE and its contractors.\n\n\"The zoning objections are not directed at immigration detention specifically, they're just being utilized as a way to throw some sand in the gears,\" he said.\n\nAdvocates: fast pace, greater risk\n\nFor immigrant rights advocates and former prison employees, concerns about the pace of ICE's detention expansion plans extend far beyond possible violations of local laws.\n\nSponsor Message\n\nImmigration attorneys have said they're already hearing increased reports of overcrowding and inhumane conditions in ICE detention centers and field offices.\n\nDetainees — many of whom lack criminal records — have gone days without food, water and bathroom access, sometimes on crowded buses when ICE can't find other places to put them, they say.\n\n\"These are types of conditions that are going to be allowed to flourish without proper oversight, with this rush to mass detention,\" said Eunice Cho, a senior staff attorney at the American Civil Liberties Union.\n\nThese reports, coupled with the prospect of what some deem infamous facilities reopening, bring back traumatic memories for inmates and staff.\n\ntoggle caption Zane Irwin/Kansas News Service\n\nMarcia Levering's voice shook as she spoke about her experience working for CoreCivic during a Leavenworth City Commission meeting in March.\n\nShe stood at a lectern with the support of a cane and a close friend standing silently beside her.\n\n\"Unit 4 accidentally buzzed open the wrong door, again because we were understaffed, allowing an inmate to come out and throw boiling water in my face,\" she said.\n\nBefore any fellow corrections officers responded, Levering said the inmate stabbed her four times while she was on the ground. A blow to the ear left one side of her face paralyzed.\n\nFour years and 16 surgeries later, Levering said she's still in recovery. Despite her injuries, she drove three hours from her home in Lincoln, Nebraska, to give her remarks.\n\nLevering said CoreCivic's refusal to go through the normal permission process in Leavenworth is emblematic of the profit-driven dynamic that altered the course of her life.\n\n\"CoreCivic took shortcuts and still wants to take shortcuts today by using a backdoor process to reopen,\" she said.\n\n",
  "tags": [],
  "collected_at": "2025-05-09T23:50:38.147931",
  "id": "1134c614eea05ba4_1746834646",
  "document_id": "1134c614eea05ba4_1746834646"
}