{
  "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
  "url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
  "source": "NPR Topics: News",
  "bias_label": "center-left",
  "published": "2025-05-09T19:55:04",
  "content": "USDA, DOGE demand states hand over personal data about food stamp recipients\n\ntoggle caption Charly Triballeau/AFP via Getty Images\n\nThe Department of Agriculture is demanding states hand over personal data of food assistance recipients — including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nThe sweeping and unprecedented request comes as the Trump administration ramps up the collection and consolidation of Americans' sensitive data, and as that data has been used to make misleading claims about people in the U.S. illegally accessing public benefits and committing fraud, and to build a greater capacity to deport them.\n\nSponsor Message\n\nThe emails obtained by NPR also show the nationwide directive regarding the Supplemental Nutrition Assistance Program, or SNAP, follows a request by federal auditors for information that included citizenship data but not other data typically used to verify financial eligibility for the program.\n\nIn 2024, SNAP served an average of 42 million people each month, according to the Department of Agriculture, at a cost of $100 billion. Only some categories of lawfully present noncitizens are eligible to receive SNAP benefits, and those without legal status can never qualify. However, a noncitizen parent without legal status may apply for the assistance on behalf of their children who are U.S. citizens.\n\nThe latest data demands are \"absolutely alarming,\" and \"reckless\" and likely violate the Privacy Act and other statutes, said John Davisson, senior counsel and director of litigation at the nonprofit Electronic Privacy Information Center. He and other advocates warn the data could be used to enable deportation and mass surveillance efforts and would do little to address improper payments.\n\n\"It is an unprecedented extension of the administration's campaign to consolidate personal data,\" Davisson said.\n\nUSDA's unusual data request\n\nSNAP, formerly known as food stamps, is a federal program. Each state administers the program and enrolls participants based on eligibility determined by Congress. While the USDA and its Office of Inspector General can audit state SNAP programs, participants' personal data typically remains under the state's control.\n\nSponsor Message\n\nIn March, the USDA's Office of Inspector General notified California, Florida, New York and Texas of inspections of their SNAP programs to see if the states were improperly using administrative funds to pay out benefits, the emails show.\n\nThat ultimately led to a request for detailed sensitive data — including citizenship status and addresses — of all SNAP participants in the previous year from at least one of the states.\n\ntoggle caption Spencer Platt/Getty Images\n\nAn April 2 update the state received from the OIG's office added a new objective: performing analytics on participant data to \"evaluate its quality and integrity.\" Yet the watchdog ultimately declined to request participants' employment status or income — which are key for determining financial eligibility for food assistance and detecting possible fraud.\n\nInstead, the request prioritized other data fields, including name, date of birth, address, contact information, Social Security number, citizenship status and information about household members, the emails show.\n\nAt an initial joint video conference, the states learned the inspections had been requested by Secretary of Agriculture Brooke Rollins, according to an official who attended the meeting but was not authorized to discuss the matter. Trump fired existing inspectors general across the federal government when he took office, including at the USDA where a new permanent leader of the office has yet to be confirmed.\n\nEarlier this week, the USDA escalated its quest for data further.\n\nIn a May 6 letter to all states, an adviser for Food, Nutrition and Consumer Services said the federal agency would be seeking personally identifiable information for SNAP applicants and recipients, including, but not limited to, \"names, dates of birth, personal addresses used, and Social Security numbers\" going back to Jan. 1, 2020. USDA did not answer NPR's questions about the full extent of personal data it was requesting.\n\nThe letter said USDA is asking private contractors that process SNAP payments for states to turn over that data, and will use it to \"ensure program integrity, including by verifying the eligibility of benefit recipients.\" The directive comes as Republican lawmakers in Congress are proposing deep cuts to the food assistance program that would reduce the number of people who participate in it.\n\nDOGE's role\n\nThe May 6 letter cited President Donald Trump's March 20 executive order, \"Stopping Waste, Fraud, and Abuse by Eliminating Information Silos,\" which calls on agencies to ensure the federal government \"has unfettered access to comprehensive data from all state programs that receive federal funding \"including from \"third-party databases\" in order to identify fraud and overpayments.\n\nThe ad hoc Department of Government Efficiency team, or DOGE, has been accessing sensitive data across the federal government in recent months and has been using allegations of wasteful and fraudulent spending to justify dismantling government agencies. Neither DOGE nor the White House responded to NPR's requests for comment.\n\nFidelity Information Services, a vendor used by some states to process electronic bank transfer transactions for SNAP programs, told its state partners the day before USDA's letter to states that the agency and its DOGE team contacted them in connection to the executive order, and that \"no proprietary, confidential, or personally identifiable information\" was shared, according to emails obtained by NPR.\n\ntoggle caption Scott Olson/Getty Images\n\n\"FIS values its close working relationship with both USDA and its state partners and is committed to supporting efforts to improve program efficiency and reduce fraud,\" reads a statement the company provided to NPR. \"As agreed with the USDA and in compliance with federal regulation, FIS has notified States of the USDA's request and is working with both to determine the most efficient manner to respond with the requested information.\"\n\nSponsor Message\n\nWired, the Washington Post and CNN have reported that DOGE is also combining sensitive data from across agencies, including Social Security Administration, Department of Homeland Security and the Internal Revenue Service, to create a data tool that can help the federal government track and arrest immigrants they want to remove.\n\nMore than a dozen federal lawsuits allege DOGE staffers have been illegally granted permission to view databases with personal and financial information the government maintains, and multiple federal judges have expressed concern about what information DOGE has accessed and why. Late last month, DHS announced a DOGE-led overhaul of its Systematic Alien Verification Entitlements (SAVE) database, making the system free for state and local governments to use and promising a \"single, reliable source for verifying non-citizen status nationwide.\"\n\nDavisson, the privacy attorney, said the SNAP data being requested could be used to make exaggerated allegations of fraud, and that combining the information with other DOGE-obtained data could be used for immigration enforcement efforts.\n\n\"What they're building is a surveillance weapon and it can be put to all sorts of adverse uses in the future,\" said Davisson.\n\nNPR asked the USDA if the agency would be following protocols outlined in the Privacy Act, such as publishing a privacy assessment and System of Records Notice for the new dataset. An unnamed spokesperson using a USDA press email account told NPR the agency's general counsel is determining whether that is required.\n\n\"All personally identifiable information will comply with all privacy laws and regulations and will follow responsible data handling requirements,\" the email said.\n\nFraud and abuse with SNAP benefits are rare\n\nAfter Trump issued an executive order in February aimed at ensuring immigrants without legal status are not receiving federal benefits, Agriculture Secretary Rollins made combatting alleged mispayments to ineligible immigrants a focus.\n\nSponsor Message\n\n\"The days in which taxpayer dollars are used to subsidize illegal immigration are over,\" Rollins said in a February press release.\n\nIn fiscal year 2023 about 11% of SNAP benefits distributed were considered improper over- or underpayments. Still, even fewer — about 1% of those — were attributed to state-level issues related to determining citizenship eligibility, according to USDA's own data.\n\nMost of the improper payments in 2022 were due to unintentional mistakes by state workers or households, rather than intentional fraud, according to an analysis of the data by the left-leaning Center for Budget and Policy Priorities.\n\nOnly 50% of eligible noncitizens (which includes refugees and green card holders) and 59% of eligible children living with noncitizen adults participated in SNAP in 2022, according to a USDA report. Overall, advocates said participation among those who are entitled to receive this benefit is low due to fears that it may have a negative impact on immigration proceedings.\n\ntoggle caption Scott Heins/Getty Images\n\nEven though immigrants without legal status are not eligible to receive SNAP or other federal benefits, SNAP data does include the names and addresses of people who could be subject to deportation now or in the future, or who share a household with people who could be.\n\nSome legal immigrants who receive SNAP benefits may lose their legal status in the future given that the administration is trying to reverse Biden-era immigration programs that granted hundreds of thousands of people the ability to live and work in the U.S.\n\nFor years, advocates and state agencies have tried to reassure immigrant families that it is safe for them to sign up for assistance if they met the eligibility requirements.\n\n\"People seeking services need to know that their information will be used only to administer the program — and won't put them or their family members at risk,\" said Tanya Broder, an attorney with the National Immigration Law Center.\n\nSponsor Message\n\n\"But the federal government's demand for 'unfettered' access to sensitive data across multiple agencies, and its aggressive pursuit of immigrants, raise serious privacy concerns and the potential that information will be weaponized against people who would go hungry without assistance.\"\n\nOn an FAQ page to sign up for food assistance from California, the site currently says the state will not report applicants' immigration status to authorities and information is used only to determine eligibility.\n\n\"Authorities cannot use this information to deport you unless there is a criminal violation,\" the state website says.\n\nNew York's website says: \"Applying for or receiving SNAP will not affect your ability to remain in the United States.\"\n\nAdvocates NPR spoke with said it is important for SNAP participants to understand that it is not yet known at this point how states will handle the USDA's pending data requests.\n\nEsther Reyes with Protecting Immigrant Families, a coalition of 700 groups across the country that help eligible immigrants access services, is urging states to check with their congressional delegations about whether the data requests are legal before responding.\n\nAs for people who may feel fearful about enrolling in SNAP given concerns over data, Reyes said, \"We really encourage families and communities to talk to enrollment workers and the people that they trust before acting on that fear.\"\n\nNPR's Ximena Bustillo contributed reporting.\n\nHave information you want to share about SNAP, DOGE access to government databases and immigration? Reach out to these authors through encrypted communication on Signal. Stephen Fowler is at stphnfwlr.25, Jude Joffe-Block is at JudeJB.10 and Ximena Bustillo is at ximenabustillo.77. Please use a nonwork device.",
  "tags": [],
  "collected_at": "2025-05-09T23:50:46.600128",
  "id": "79a386d8c50c4229_1746834646",
  "document_id": "79a386d8c50c4229_1746834646"
}