{
  "title": "US and UK agree deal slashing Trump tariffs on cars and metals",
  "url": "https://www.bbc.com/news/articles/cp92r2kvk74o",
  "source": "BBC News",
  "bias_label": "center",
  "published": "2025-05-08T22:55:32",
  "content": "US and UK agree deal slashing Trump tariffs on cars and metals\n\n20 hours ago Share Save Natalie Sherman BBC News Share Save\n\nWatch: US-UK relationship will soon be 'stronger than ever before' - Trump\n\nThe US has agreed to reduce import taxes on a set number of British cars and allow some steel and aluminium into the country tariff-free, as part of a new agreement between the US and UK. The announcement offers relief for key UK industries from some of the new tariffs President Donald Trump has announced since his return to the White House in January. But it will leave a 10% duty in place on most goods from the UK. Though hailed by the leaders of the two countries as significant, analysts said it did not appear to meaningfully alter the terms of trade between the countries, as they stood before the changes introduced by Trump this year.\n\nNo formal deal was signed on Thursday and the announcements from both governments were light on details. Speaking from a Jaguar Land Rover factory in the West Midlands, Sir Keir Starmer described the agreement as a \"fantastic platform\". \"This historic deal delivers for British business and British workers protecting thousands of British jobs in key sectors including car manufacturing and steel,\" he said, adding that the \"the UK has no greater ally than the United States\". At the White House, Trump called it a \"great deal\" and pushed back against criticism that he was overstating its importance. \"This is a maxed out deal that we're going to make bigger,\" he said.\n\nWhat's in the deal?\n\nThe two sides said the US had agreed to reduce the import tax on cars - which Trump had raised by 25% last month - to 10% for 100,000 cars a year. That will help luxury carmakers such as Jaguar Land Rover and Rolls Royce, but could limit growth in the years ahead, as it amounts to roughly what the UK exported last year. Business Secretary Jonathan Reynolds told the BBC the UK was days away from losing thousands of jobs at carmakers facing US tariffs. \"This was very serious,\" he said. \"It would have meant people would have lost their jobs without this breakthrough.\" Tariffs on steel and aluminium, which Trump raised earlier this year to 25%, have also been slashed, according to the Prime Minister's Office. The US said instead it would establish a quota, as had existed previously. The two countries also each agreed to allow the import of up to 13,000 metric tonnes of beef from the other country, according to documents released by the US Trade Representative. The US said the change would significantly expand its sales of beef to the UK, which had previously faced 20% duties and were capped at 1,000 metric tonnes. Overall, the US said the deal would create a $5bn (£3.8bn) \"opportunity\" for exports, including $700m in ethanol and $250m in other agricultural products. \"It can't be understated how important this deal is,\" US Agriculture Secretary Brooke Rollins said.\n\nWhat's the reaction?\n\nUK Steel director General Gareth Stace welcomed the agreement, saying it would offer \"major relief\" to the steel sector. \"The UK government's cool-headed approach and perseverance in negotiating with the US clearly paid off,\" he said. Other business groups expressed more uncertainty. \"It's better than yesterday but it's definitely not better than five weeks ago,\" said Duncan Edwards, chief executive of BritishAmerican Business, which represents firms in the two countries and supports free trade. \"I'm trying to be excited but I'm struggling a bit.\" While Labour MPs praised the deal, opposition parties asked for more detail and scrutiny in Parliament. Conservative Party leader Kemi Badenoch criticised the deal, saying it amounted to tariffs being lowered by the UK, while being hiked in the US. \"This is not a historic deal with the US,\" she said. \"We've been shafted.\" The Liberal Democrats demanded a vote on the deal in Parliament, saying it would show \"complete disrespect to the public\" if MPs were denied a say. Sir Ed Davey said: \"When it comes to any trade deal - and especially one with someone as unreliable as Donald Trump - the devil will be in the detail. \"One thing is clear, Trump's trade tariffs are still hitting key British industries, threatening the livelihoods of people across the UK.\" Reform UK Leader Nigel Farage said the deal was a \"step in the right direction\". He told the BBC there was more detail to come but in the round it was a welcome development. \"The important point is that we are doing stuff, we are making a move,\" he said. \"It's a Brexit benefit we were able to do this.\"\n\nWin for US ranchers?",
  "tags": [],
  "collected_at": "2025-05-09T13:11:41.726010",
  "id": "4b3bc76e2099ac9b_1746814310",
  "document_id": "4b3bc76e2099ac9b_1746814310"
}